<a href="https://colab.research.google.com/github/hannasss/SOLUX_summer_data/blob/master/pandas10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
date_list = [{'yyyy-mm-dd':'2000-06-27'},
             {'yyyy-mm-dd':'2002-09-24'},
             {'yyyy-mm-dd':'2005-12-20'}
            ]
df = pd.DataFrame(date_list,columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

'-'으로 구분하고 첫번째값 추출하는 함수 생성

In [ ]:
def extract_year(column):
    return column.split("-")[0]

'year'생성하고 함수 적용

In [ ]:
df['year']=df['yyyy-mm-dd'].apply(extract_year)

In [ ]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [ ]:
def get_age(year,current_year):
    return current_year -int(year)

In [ ]:
df['age']=df['year'].apply(get_age,current_year=2020)

In [ ]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   20
1  2002-09-24  2002   18
2  2005-12-20  2005   15

In [ ]:
def get_introduce(age,prefix,suffix):
    return prefix+str(age)+suffix

In [ ]:
df['introduce']=df['age'].apply(get_introduce,prefix="I am ",suffix=" years old")

In [ ]:
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   20  I am 20 years old
1  2002-09-24  2002   18  I am 18 years old
2  2005-12-20  2005   15  I am 15 years old

In [ ]:
def get_introduce_2(row):
    return "I was born in "+str(row.year)+" my age is "+str(row.age)

In [ ]:
df['introduce_2'] = df.apply(get_introduce_2,axis = 1)

In [ ]:
df

,yyyy-mm-dd,year,age,introduce,introduce_2
0,2000-06-27,2000,20,I was born in 2000 my age is 20,I was born in 2000 my age is 20
1,2002-09-24,2002,18,I was born in 2002 my age is 18,I was born in 2002 my age is 18
2,2005-12-20,2005,15,I was born in 2005 my age is 15,I was born in 2005 my age is 15